depot/depotG/app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "newer stuff"], ["description", "this is the very best new stuff ever.  you need to buy this now!"], ["updated_at", "2017-06-12 17:14:39.961420"], ["id", 7]]