depot/depotF/app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)
  #  @line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 207281424], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-06-12 18:01:06.094942"], ["updated_at", "2017-06-12 18:01:06.094942"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 207281424], ["cart_id", 980190963], ["created_at", "2017-06-12 18:01:06.106129"], ["updated_at", "2017-06-12 18:01:06.106129"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2017-06-12 17:07:29.564398"], ["id", 1]]